tests/load/artillery-search.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 120
      arrivalRate: 50
      name: Sustained load
  defaults:
    headers:
      Accept: application/json

scenarios:
  - name: Search products
    flow:
      - get:
          url: '/api/search?keyword=iphone&limit=20'
      - get:
          url: '/api/search/suggestions?q=lap'
      - get:
          url: '/api/search/popular-keywords?limit=10'